# **Space X  Falcon 9 First Stage Landing Prediction**

## EDA with SQL: Analysing Scraped Data

### Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

The dataset used in this section was made up of scraped data from the last section. This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Connecting to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

In [2]:
import csv, sqlite3
import prettytable
prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [3]:
%sql sqlite:///my_data1.db

In [4]:
import pandas as pd
df = pd.read_csv('.//Datasets//spacex_web_scraped.csv')
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

121

**The code below is added to remove blank rows from table**

In [5]:
#DROP THE TABLE IF EXISTS

%sql DROP TABLE IF EXISTS SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[]

In [6]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

## Queries

Now we will write and execute SQL queries to perform some Exploratory Data Analysis (EDA).


### Query 1




##### Displaying the names of the unique launch sites  in the space mission

In [7]:
#Taking an overview of the table
%sql select * from SPACEXTABLE limit(5)

 * sqlite:///my_data1.db
Done.

[(1, '4 June 2010', '18:45', 'F9 v1.0 B0003.1', 'CCAFS SLC-40', 'Dragon Spacecraft Qualification Unit', None, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 (2, '8 December 2010', '15:43', 'F9 v1.0 B0004.1', 'CCAFS SLC-40', 'Dragon demo flight C1 (Dragon C101)', None, 'LEO ( ISS )', 'NASA ( COTS ) NRO', 'Success', 'Failure (parachute)'),
 (3, '22 May 2012', '07:44', 'F9 v1.0 B0005.1', 'CCAFS SLC-40', 'Dragon demo flight C2+ (Dragon C102)', '525', 'LEO ( ISS )', 'NASA ( COTS )', 'Success', 'No attempt'),
 (4, '8 October 2012', '00:35', 'F9 v1.0 B0006.1', 'CCAFS SLC-40', 'SpaceX CRS-1 (Dragon C103)', '4700', 'LEO ( ISS )', 'NASA ( CRS )', 'Success', 'No attempt'),
 (5, '1 March 2013', '15:10', 'F9 v1.0 B0007.1', 'CCAFS SLC-40', 'SpaceX CRS-2 (Dragon C104)', '4877', 'LEO ( ISS )', 'NASA ( CRS )', 'Success', 'No attempt')]

In [8]:
#Displaying the unique values in the Launch site coloumn
%sql select distinct [Launch site] from SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[('CCAFS SLC-40',),
 ('VAFB SLC-4E',),
 ('Cape Canaveral LC-40',),
 ('KSC LC-39A',),
 ('Cape Canaveral SLC-40',),
 ('CCSFS SLC-40',)]


### Query 2


#####  Displaying 5 records where launch sites begin with the string 'CCA'

In [9]:
%sql select * from SPACEXTABLE where [Launch site] like 'CCA%' limit(5) --'(5)' can be adjusted to increase or decrease the number of records displayed

 * sqlite:///my_data1.db
Done.

[(1, '4 June 2010', '18:45', 'F9 v1.0 B0003.1', 'CCAFS SLC-40', 'Dragon Spacecraft Qualification Unit', None, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 (2, '8 December 2010', '15:43', 'F9 v1.0 B0004.1', 'CCAFS SLC-40', 'Dragon demo flight C1 (Dragon C101)', None, 'LEO ( ISS )', 'NASA ( COTS ) NRO', 'Success', 'Failure (parachute)'),
 (3, '22 May 2012', '07:44', 'F9 v1.0 B0005.1', 'CCAFS SLC-40', 'Dragon demo flight C2+ (Dragon C102)', '525', 'LEO ( ISS )', 'NASA ( COTS )', 'Success', 'No attempt'),
 (4, '8 October 2012', '00:35', 'F9 v1.0 B0006.1', 'CCAFS SLC-40', 'SpaceX CRS-1 (Dragon C103)', '4700', 'LEO ( ISS )', 'NASA ( CRS )', 'Success', 'No attempt'),
 (5, '1 March 2013', '15:10', 'F9 v1.0 B0007.1', 'CCAFS SLC-40', 'SpaceX CRS-2 (Dragon C104)', '4877', 'LEO ( ISS )', 'NASA ( CRS )', 'Success', 'No attempt')]

### Query 3




##### Displaying the total payload mass carried by boosters launched by NASA (CRS)

In [10]:
%sql select sum([Payload mass kg]) from SPACEXTABLE where Customer='NASA ( CRS )'

 * sqlite:///my_data1.db
Done.

[(59941,)]

### Query 4




##### Displaying average payload mass carried by booster version F9 v1.1

In [11]:
%sql select avg([Payload mass kg]) from SPACEXTABLE where [Version Booster] like 'F9 v1.1%'

 * sqlite:///my_data1.db
Done.

[(2534.6666666666665,)]

### Query 5

##### Listing the date when the first succesful landing outcome in ground pad was acheived.

In [12]:
%sql select min(Date) from SPACEXTABLE where [Booster landing]='Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('1 May 2017',)]

### Query 6

##### Listing the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [13]:
%sql select distinct([Version Booster]) from SPACEXTABLE where [Booster landing]='Success (drone ship)' and [Payload mass kg]	>4000 and [Payload mass kg]	<6000

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022.1',),
 ('F9 FT B1026.1',),
 ('F9 FT B1021.2',),
 ('F9 FT B1038.1',),
 ('F9 FT B1031.2',),
 ('F9 B5 B1046.2',),
 ('F9 B5 B1047.2',),
 ('F9 B5 B1048.3',),
 ('F9 B5 B1060.1',),
 ('F9 B5 B1062.1',),
 ('F9 B5 B1058.5',)]

### Query 7




##### Listing the total number of successful and failure mission outcomes

In [14]:
%sql select [Launch outcome], count(*) as Total from SPACEXTABLE group by [Launch outcome]

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1), ('Success', 120)]

### Query 8



##### Listing all the booster_versions that have carried the maximum payload mass, using a subquery with a suitable aggregate function.

In [15]:
%sql select distinct([Version Booster]) from SPACEXTABLE where [Payload mass kg] = (select max([Payload mass kg]) from SPACEXTABLE)

 * sqlite:///my_data1.db
Done.

[('F9 FT B1032.1',), ('F9 B4 B1043.1',), ('F9 B5 B1059.5',)]

### Query 9


##### Listing the records which will display the month names, failure landing_outcomes in drone ship, booster versions, launch_site for the months in year 2015.

In [16]:
%sql select substr(Date,4,3) as Month, [Version Booster], [Launch site], [Booster landing] from SPACEXTABLE where Date like '%2015' and trim([Booster landing]) = 'Failure (drone ship)'

 * sqlite:///my_data1.db
Done.

[('Jan', 'F9 v1.1 B1012', 'Cape Canaveral LC-40', 'Failure (drone ship)'),
 ('Apr', 'F9 v1.1 B1015', 'Cape Canaveral LC-40', 'Failure (drone ship)')]

### Query 10




##### Ranking the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [17]:
%sql select [Booster landing], count(*) as [Outcome Count] from SPACEXTABLE where date between '04-06-2010' and '20-03-2017' group by [Booster landing] order by [Outcome Count] desc

 * sqlite:///my_data1.db
Done.

[('Success (drone ship)', 21),
 ('Success (ground pad)', 7),
 ('Failure (drone ship)', 7),
 ('No attempt', 6),
 ('Controlled (ocean)', 3)]

## Author
**Filipe B. Carvalho**

**Email:** [filipebraiman@gmail.com](mailto:filipebraiman@gmail.com)  
**LinkedIn:** [linkedin.com/in/filipe-b-carvalho](https://www.linkedin.com/in/filipe-b-carvalho)  
**GitHub:** [github.com/filipe-braiman](https://github.com/filipe-braiman)  

### About Me  
Data and AI professional with experience in **AI model evaluation, data annotation, and NLP projects**, currently contributing to AI initiatives at **Huawei**. Skilled in **Python, SQL, data visualization, machine learning, AI, and dataset building**, and certified through the **IBM Data Science Professional Certificate**. Multilingual in **Portuguese, English, Spanish, Turkish, and French**, bringing a linguistic and analytical perspective to data-driven problem solving. Passionate about leveraging data and AI to create practical, high-impact solutions.

---

### Version History

| Version | Date       | Changes                         |
|:--------:|:-----------|:--------------------------------|
| 1.0      | 2025-10-29 | First publication of the notebook |